// 防抖？ 节流？ 区别？
// 防抖：
// 触发高频事件后n秒内只会执行一次，如果n秒内该事件再次被触发，则重新计算时间。
// 节流：
// 高频事件被触发，但在n秒内只会执行一次，节流会稀释函数的执行频率。
// 区别：
// 防抖和节流本质上是不一样的，防抖是将多次执行变成最后一次执行，节流是将多次执行变成每隔一段时间执行。

// const arr = [3, 15, 8, 29, 102, 22]
// 使用sort()排序，输出的结果是。(有坑)


// <img src="" style="width: 480px!important;" alt="" />>
// 不修改结构代码，只修样式代码，如何将该图片的宽度设置为300px？
// 1. transform: scale(0.625) // 300/480
// 2. zoom(0.625)
// 3. max-width: 300px;
// 4. 

// OOP
// Oeject Oriented Programming 面向对象编程

// CRUD
// Create Read Update Delete